#+title: NIX DARWIN CONFIGURATION
#+author: s.takoor
#+auto_tangle: t
#+filetags: :nix:darwin:literate:config:

#+begin_quote
In the beginning, there was ~nix~. All things were made by ~nix~; and without it was not any thing made that was made. In ~nix~ was life; and life was the light of the ~systems~. And the light shineth in ~systems~; and the ~systems~ comprehendeth it not. For ~nix~ is ~declarative~, ~immutable~, and ~reproducible~, bringing order and harmony to the ~systems~.
#+end_quote

* ðŸŽ¯ OVERVIEW
~Nix~ is a powerful package manager for ~Linux~ and ~Unix~ systems that ensures ~reproducible~, ~declarative~, and ~reliable~ software management.

This ~README~ file serves as the blueprint for the system configuration. It uses a process known as ~tangling~ to automatically generate and organize all necessary ~.nix~ files for this setup.

Here's how it helps manage everything:
- ~tangling configurations~: the ~README.org~ file automatically generates the required ~.nix~ files from the ~org-mode~ content
- ~organize files~: after ~tangling~, it creates and organizes all the ~.nix~ files into the appropriate directories (creating directories if they don't exist with the ~:mkdirp yes~ option)
- ~imports~ and ~dependencies~: the generated ~flake.nix~ file pulls in other ~.nix~ files to manage dependencies and configurations
- ~takeaway~: modifications are made only in this ~README.org~ file and the ~org-auto-tangle~ feature from ~emacs~ handles the creation and updating all necessary ~config~ files

Here's a breakdown of what the ~README.org~ is generating:
#+NAME: tokei
#+begin_src sh :exports results
tokei ~/.config/nixcfg/*
#+end_src

#+RESULTS: tokei
| =============================================================================== |       |       |      |          |        |
| Language                                                                      | Files | Lines | Code | Comments | Blanks |
| =============================================================================== |       |       |      |          |        |
| Lua                                                                           |     1 |    64 |   35 |       14 |     15 |
| Nix                                                                           |    52 |  1529 | 1137 |      250 |    142 |
| Org                                                                           |     1 |  2081 | 1574 |      243 |    264 |
| =============================================================================== |       |       |      |          |        |
| Total                                                                         |    54 |  3674 | 2746 |      507 |    421 |
| =============================================================================== |       |       |      |          |        |

